package Pages;

public enum  ShippingZone {
    MYTISHCHI("Мытищи г, Мытищинский р-н, Московска"),
    GROZNY("Грозный, Чеченская Республика"),
    BASKUNCHAK("Средний Баскунчак, Астраханская обла"),
    VOLGODONSK("Волгодонск, Ростовская область"),
    WHITEKEY("Белый Ключ, Ульяновская область"),
    KOSTROMA("Кострома, Костромская область"),
    DOBRUN("Добрунь, Брянская область"),
    MALINOVKA("Малиновка, Кемеровская область"),
    GORNOALTAYSK("Горно-Алтайск, Республика Алтай"),
    SAYANSK("Саянск, Иркутская область"),
    KORSAKOV("Корсаков, Сахалинская область"),
    TASHANTA("Ташанта, Республика Алтай"),
    VLADIMIR("Владимир, Иркутская область"),
    MAGADAN("Магадан, Магаданская область"),
    PALATKA("Палатка, Магаданская область"),
    STPETERSBURG("Санкт-Петербург"),
    SURGUT("Сургут, Ханты-Мансийский Автономный"),
    KRASNOYARSK("Красноярск, Красноярский край"),
    MOSCOW("Москва (в пределах МКАД)"),
    BRATSK("Братск, Иркутская область"),
    HOHRYAKI("Хохряки, Удмуртская Республика"),
    NOYABRSK("Ноябрьск, Ямало-Ненецкий АО"),
    TUAPSE("Туапсе, Краснодарский край"),
    RUBTSOVSK("Рубцовск, Алтайский край"),
    KAMYSHLOVSKY("Камышловский, Омская область"),
    YAKUTSK("Якутск, Республика Саха (Якутия)"),
    KOZINO("Козино д, Щёлковский р-н, Московская"),
    POTAPOVO("Потапово д, Подольский р-н, Московск"),
    ;

    private final String text;

    ShippingZone(String text) {
        this.text = text;
    }

    @Override
    public String toString() {
        return text;
    }
}
